Autodesk.Revit.DB.PointClouds.PointCloudOverrides.ArePointCloudOverrideSettingsValid(System.String,Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings)
Checks if PointCloudOverrideSettings are valid
scanTag:
The tag identifying the particular scan within the PointCloudInstance element.
Tags can be obtained from PointCloudInstance via method getScans.
settings:
Override settings to be checked.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014